CaseAPI/getCase.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://soap.sforce.com/schemas/class/APIUtils" xmlns:cas="http://soap.sforce.com/schemas/class/CaseAPI">
   <soapenv:Header>
     
      <cas:SessionHeader>
         <cas:sessionId>00D2i0000000Ml4!AQIAQKt8s7UfiWplkXGsGEa8lVZkZKL98mBw88wtMAcSo_OK4MlX6QClExmy89ClLACHP1VKzLs0e2AsCDZywFY8r9MCqjMy</cas:sessionId>
      </cas:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <cas:getCase>
         <cas:cContext>
           
            <api:ssoName>rhn-support-kmashalk</api:ssoName>
         </cas:cContext>
         <cas:caseContext>
            <!--Optional:-->
            <api:caseNum>02470917</api:caseNum>
         </cas:caseContext>
      </cas:getCase>
   </soapenv:Body>
</soapenv:Envelope>
